* Finding the code
What the paper discusses is basically a validation of a general method and library for computing hydrodynamic interactions in systems composed of spherical particles. The code consists of two parts:

  1. The library, called HYDROLIB, which was published in Comp. Phys. Comm. ([[https://doi.org/10.1016/0010-4655(95)00029-F][Vol. 88, page 327]]). It is written in Fortran 77 and was very portable at the time.

  2. The application programs that define the geometry of the conglomerates of spheres and pass it to HYDROLIB. They were not published.

The paper describing HYDROLIB says
#+begin_quote
Catalogue number ADBK.

Program obtainable from: CPC Program Library, Queen's University of Belfast, N. Ireland (see application form in this issue).
#+end_quote

The journal still exists, and its home page contains a link to today's [[https://data.mendeley.com/datasets/journals/00104655][CPC Program Library]], but I have not been able to find HYDROLIB there. I contacted the editor and received the reply that the old archive is still available at http://cpc.cs.qub.ac.uk/, and that its entries would soon be transferred to the new archive. I could retrieve HYDROLIB using the catalogue number from the paper.

A few years ago, I found a copy of HYDROLIB on the hard disk of an old computer, and put it [[https://github.com/khinsen/HYDROLIB][on GitHub]]. I assumed that this was the version that was published in CPC, though I could not be completely certain. A comparison with the code from the CPC archive shows that the GitHub code contains two bug fixes from 2002 (an integer variable was erroneously declared as real or double precision). Moreover, a file with numerical coefficients has differences, and it's the GitHub version that looks erroneous, containing zero bytes in the middle of a text file. A so-far undetected case of data corruption! It is unlikely to have had serious consequences because it concerns only the lowest-level approximation, which is not very good anyway and therefore hardly used.

Since the initial publication on GitHub, I made minor fixes to the setup scripts in order to support more recent compilers, following requests by new users of the library. For the curious: the most recent support request for HYDROLIB is from 2017.

So far I have not been able to find the unpublished application programs. I have two backup tapes in DDS-1 and DDS-2 format from 1998 and 1999 that most probably contain a copy, but so far I have not been able to find a reader for these tapes. Until about 2010, I still had a PC with a tape reader in my office.

* Reproducible HYDROLIB installation and test run
The version of HYDROLIB that I published on GitHub in 2015, with modifications to the installation procedure for GNU Fortran under Linux, still works fine today. For the record, this is how installing and running the example application is done under Guix:

** Fix the Guix version
To use the current Guix version on your system (the one from your last =guix pull=), replace =guix-command= by a plain =guix=.
#+NAME: guix-command
guix time-machine --commit=f76c16d220e6c349441c08bf25a5197037490fa5 --

** Download and unpack the source code
#+begin_src sh :results output :exports both :var guix_command=guix-command
$guix_command environment --pure --ad-hoc wget unzip coreutils
wget -O hydrolib.zip https://github.com/khinsen/HYDROLIB/archive/c0e7834a17c7046a6e4c0a27b980aaf5919aecd5.zip
unzip hydrolib.zip
rm hydrolib.zip
mv HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5 HYDROLIB
#+end_src

#+RESULTS:
#+begin_example
Archive:  hydrolib.zip
c0e7834a17c7046a6e4c0a27b980aaf5919aecd5
   creating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/.gitignore  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/LICENSE.txt  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/README  
   creating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/Makefile  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/daxpy.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dcopy.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/ddot.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dgemm.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dgemv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dger.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dnrm2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/drot.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dscal.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dspr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dswap.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dsymv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dsyr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dsyr2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dsyr2k.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dsyrk.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dtpsv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dtrmm.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dtrmv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/dtrsm.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/idamax.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/isamax.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/lsame.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/saxpy.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/scopy.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sdot.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sgemm.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sgemv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sger.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/snrm2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/srot.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sscal.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sspr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/sswap.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/ssymv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/ssyr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/ssyr2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/ssyr2k.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/ssyrk.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/stpsv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/strmm.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/strmv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/strsm.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/blas/xerbla.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/config.h  
   creating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/doc/
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/doc/guide.tex  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/example.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/example.h  
   creating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/fc.temp  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/fcomp  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/fn  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/fprog.temp  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/gcalc.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/gcalc_dp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/hcoeff  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/lubrication.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/lubrication_dp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/makefile  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/ocoeff  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/pbc.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/pbc_dp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/rigid.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/rigid_dp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/subr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/subr_dp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/z2cl0  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/z2cl1  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/z2cl2  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/hydrolib/z2cl3  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/install_lib  
   creating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lalib/
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lalib/README  
   creating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/Makefile  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dgesv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dgetf2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dgetrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dgetri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dgetrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlacon.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlae2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlaev2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlamch.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlansy.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlapy2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlarf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlarfb.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlarfg.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlarft.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlartg.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlasr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlassq.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlaswp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlasyf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlatrd.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlauu2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlauum.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dlazro.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dorg2l.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dorg2r.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dorgql.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dorgqr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dorgtr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dpotf2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dpotrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dpotri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dpotrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dpptrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dpptrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsptrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsptrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsteqr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsterf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsycon.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsyev.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsytd2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsytf2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsytrd.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsytrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsytri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dsytrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dtrti2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/dtrtri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ilaenv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/lsame.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sgesv.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sgetf2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sgetrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sgetri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sgetrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slacon.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slae2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slaev2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slamch.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slansy.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slapy2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slarf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slarfb.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slarfg.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slarft.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slartg.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slasr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slassq.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slaswp.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slasyf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slatrd.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slauu2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slauum.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/slazro.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sorg2l.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sorg2r.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sorgql.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sorgqr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/sorgtr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/spotf2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/spotrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/spotri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/spotrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/spptrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/spptrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssptrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssptrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssteqr.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssterf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssycon.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssyev.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssytd2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssytf2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssytrd.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssytrf.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssytri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/ssytrs.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/strti2.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/strtri.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/lapack/xerbla.f  
  inflating: HYDROLIB-c0e7834a17c7046a6e4c0a27b980aaf5919aecd5/local.def  
#+end_example

** HYDROLIB configuration
Uncomment the lines for =gfortran= in the configuration file:
#+begin_src sh :results output :exports both :var guix_command=guix-command
cd HYDROLIB
$guix_command environment --pure --ad-hoc sed -- sed -i '8,13s/#set/set/' local.def
#+end_src

#+RESULTS:

Show the relevant lines for inspection:
#+begin_src sh :results output :exports both :var guix_command=guix-command
$guix_command environment --pure --ad-hoc coreutils -- head -15 HYDROLIB/local.def
#+end_src

#+RESULTS:
#+begin_example
#
# Some definitions depending on the local installation
#

# Fortran compiler peculiarities

# gfortran
setenv FC gfortran
setenv RANLIB ranlib
setenv FCFLAGS1 "-ffree-line-length-none -ffixed-line-length-none -c -O"
setenv FCFLAGS2 "-ffree-line-length-none -ffixed-line-length-none -O"
set cpp = 1
set dpoption = -fdefault-real-8

# DEC, Silicon Graphics
#+end_example

Replace =!/bin/csh= by its Guix equivalent in the four csh scripts:
#+begin_src sh :results output :exports both :var guix_command=guix-command
cd HYDROLIB
$guix_command environment --pure --ad-hoc sed tcsh coreutils
tcsh=`readlink $GUIX_ENVIRONMENT/bin/tcsh`
for FILE in install_lib hydrolib/fprog.temp hydrolib/fcomp hydrolib/fc.temp
do
  sed -i s:#!/bin/csh:#!$tcsh: $FILE
done
#+end_src

#+RESULTS:

** HYDROLIB compilation/installation
This is not an installation in the modern sense of the word: nothing happens outside of the HYDROLIB directory.

#+begin_src sh :results output :exports both :var guix_command=guix-command
cd HYDROLIB
$guix_command environment --pure --ad-hoc tcsh coreutils make sed grep gfortran-toolchain -- tcsh install_lib
#+end_src

#+RESULTS:
#+begin_example
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O daxpy.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgemm.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dnrm2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dspr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsyr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsyrk.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dtrmv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O lsame.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dcopy.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgemv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O drot.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dswap.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsyr2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dtpsv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dtrsm.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O xerbla.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ddot.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dger.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dscal.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsymv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsyr2k.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dtrmm.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O idamax.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O saxpy.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgemm.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O snrm2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sspr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssyr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssyrk.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O strmv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O scopy.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgemv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O srot.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sswap.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssyr2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O stpsv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O strsm.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sdot.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sger.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sscal.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssymv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssyr2k.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O strmm.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O isamax.f
ar r libblas.a daxpy.o dgemm.o dnrm2.o dspr.o dsyr.o dsyrk.o dtrmv.o lsame.o dcopy.o dgemv.o drot.o dswap.o dsyr2.o dtpsv.o dtrsm.o xerbla.o ddot.o dger.o dscal.o dsymv.o dsyr2k.o dtrmm.o idamax.o saxpy.o sgemm.o snrm2.o sspr.o ssyr.o ssyrk.o strmv.o scopy.o sgemv.o srot.o sswap.o ssyr2.o stpsv.o strsm.o sdot.o sger.o sscal.o ssymv.o ssyr2k.o strmm.o isamax.o
ranlib libblas.a
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgesv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlaev2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlarft.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlauu2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dorgtr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsptrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsytf2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ilaenv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgetf2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlamch.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlartg.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlauum.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dpotf2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsptrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsytrd.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O lsame.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgetrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlansy.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlasr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlazro.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dpotrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsteqr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsytrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O xerbla.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgetri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlapy2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlassq.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dorg2l.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dpotri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsterf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsytri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dgetrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlarf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlaswp.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dorg2r.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dpotrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsycon.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsytrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlacon.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlarfb.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlasyf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dorgql.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dpptrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsyev.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dtrti2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlae2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlarfg.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dlatrd.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dorgqr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dpptrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dsytd2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O dtrtri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgesv.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slaev2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slarft.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slauu2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sorgtr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssptrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssytf2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgetf2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slamch.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slartg.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slauum.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O spotf2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssptrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssytrd.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgetrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slansy.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slasr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slazro.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O spotrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssteqr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssytrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgetri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slapy2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slassq.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sorg2l.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O spotri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssterf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssytri.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sgetrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slarf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slaswp.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sorg2r.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O spotrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssycon.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssytrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slacon.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slarfb.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slasyf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sorgql.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O spptrf.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssyev.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O strti2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slae2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slarfg.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O slatrd.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O sorgqr.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O spptrs.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O ssytd2.f
gfortran -ffree-line-length-none -ffixed-line-length-none -c -O strtri.f
ar r liblapack.a dgesv.o dlaev2.o dlarft.o dlauu2.o dorgtr.o dsptrf.o dsytf2.o ilaenv.o dgetf2.o dlamch.o dlartg.o dlauum.o dpotf2.o dsptrs.o dsytrd.o lsame.o dgetrf.o dlansy.o dlasr.o dlazro.o dpotrf.o dsteqr.o dsytrf.o xerbla.o dgetri.o dlapy2.o dlassq.o dorg2l.o dpotri.o dsterf.o dsytri.o dgetrs.o dlarf.o dlaswp.o dorg2r.o dpotrs.o dsycon.o dsytrs.o dlacon.o dlarfb.o dlasyf.o dorgql.o dpptrf.o dsyev.o dtrti2.o dlae2.o dlarfg.o dlatrd.o dorgqr.o dpptrs.o dsytd2.o dtrtri.o sgesv.o slaev2.o slarft.o slauu2.o sorgtr.o ssptrf.o ssytf2.o sgetf2.o slamch.o slartg.o slauum.o spotf2.o ssptrs.o ssytrd.o sgetrf.o slansy.o slasr.o slazro.o spotrf.o ssteqr.o ssytrf.o sgetri.o slapy2.o slassq.o sorg2l.o spotri.o ssterf.o ssytri.o sgetrs.o slarf.o slaswp.o sorg2r.o spotrs.o ssycon.o ssytrs.o slacon.o slarfb.o slasyf.o sorgql.o spptrf.o ssyev.o strti2.o slae2.o slarfg.o slatrd.o sorgqr.o spptrs.o ssytd2.o strtri.o
ranlib liblapack.a
./fcomp gcalc.f gcalc0.o -D_LM_=0 
./fcomp gcalc.f gcalcpbc0.o -D_LM_=0 -DPERIODIC 
./fcomp gcalc.f gcalc1.o -D_LM_=1 
./fcomp gcalc.f gcalcpbc1.o -D_LM_=1 -DPERIODIC 
./fcomp gcalc.f gcalc2.o -D_LM_=2 
./fcomp gcalc.f gcalcpbc2.o -D_LM_=2 -DPERIODIC 
./fcomp gcalc.f gcalc3.o -D_LM_=3 
./fcomp gcalc.f gcalcpbc3.o -D_LM_=3 -DPERIODIC 
./fcomp lubrication.f lubrication.o 
./fcomp lubrication.f lubricationpbc.o -DPERIODIC 
./fcomp gcalc_dp.f gcalc0.o -D_LM_=0 -DDP
./fcomp gcalc_dp.f gcalcpbc0.o -D_LM_=0 -DPERIODIC -DDP
./fcomp gcalc_dp.f gcalc1.o -D_LM_=1 -DDP
./fcomp gcalc_dp.f gcalcpbc1.o -D_LM_=1 -DPERIODIC -DDP
./fcomp gcalc_dp.f gcalc2.o -D_LM_=2 -DDP
./fcomp gcalc_dp.f gcalcpbc2.o -D_LM_=2 -DPERIODIC -DDP
./fcomp gcalc_dp.f gcalc3.o -D_LM_=3 -DDP
./fcomp gcalc_dp.f gcalcpbc3.o -D_LM_=3 -DPERIODIC -DDP
./fcomp lubrication_dp.f lubrication.o -DDP
./fcomp lubrication_dp.f lubricationpbc.o -DPERIODIC -DDP
#+end_example

** Compile and run the example application
#+begin_src sh :results output :exports both :var guix_command=guix-command
cd HYDROLIB
$guix_command environment --pure --ad-hoc tcsh coreutils sed gawk grep gfortran-toolchain
./fc example.f
./a.out
#+end_src

#+RESULTS:
:  N=           6
:    3.2887924196913199        4.2969105450808964     
:    9.9128994543717965        94.715052511083215     

** List all dependencies with version numbers
The Guile script =show-dependencies.scm= performs a deep dependency analysis starting from the packages listed on the command line. See [[https://guix.gnu.org/blog/2020/reproducible-computations-with-guix/][this blog post]] for an explanation of what the three different levels of dependencies mean precisely.
#+begin_src sh :results output :exports both :var guix_command=guix-command
$guix_command environment --container --ad-hoc guix guile -- guile -s show-dependencies.scm wget unzip tcsh coreutils sed gawk grep make gfortran-toolchain 
#+end_src

#+RESULTS:
: Packages: 9
:   coreutils@8.31 gawk@5.0.1 gfortran-toolchain@7.4.0 grep@3.3 make@4.2.1 sed@4.7 tcsh@6.20.00 unzip@6.0 wget@1.20.3
: Package inputs: 22 packages
:   acl@2.2.53 autoconf@2.69 binutils@2.32 bzip2@1.0.6 gfortran@7.4.0 glibc@2.29 gmp@6.1.2 gnutls@3.6.9 guile@2.0.14 ld-wrapper@0 libcap@2.27 libidn2@2.2.0 libpsl@0.21.0 libsigsegv@2.12 lzip@1.21 ncurses@6.1-20190609 pcre@8.43 perl-http-daemon@6.01 perl-io-socket-ssl@2.066 perl@5.30.0 pkg-config@0.29.2 python@3.7.4
: Build inputs: 45 packages
:   [source code from (ftp://ftp.astron.com/pub/tcsh/tcsh-6.20.00.tar.gz ftp://ftp.astron.com/pub/tcsh/old/tcsh-6.20.00.tar.gz)] [source code from mirror://gnu/coreutils/coreutils-8.31.tar.xz] [source code from mirror://gnu/gawk/gawk-5.0.1.tar.xz] [source code from mirror://gnu/grep/grep-3.3.tar.xz] [source code from mirror://gnu/make/make-4.2.1.tar.bz2] [source code from mirror://gnu/sed/sed-4.7.tar.xz] [source code from mirror://gnu/wget/wget-1.20.3.tar.lz] [source code from mirror://sourceforge/infozip/UnZip%206.x%20%28latest%29/UnZip%206.0/unzip60.tar.gz] acl@2.2.53 autoconf@2.69 bash-minimal@5.0.7 binutils@2.32 bzip2@1.0.6 coreutils@8.31 diffutils@3.7 file@5.33 findutils@4.6.0 gawk@5.0.1 gcc@7.4.0 gfortran@7.4.0 glibc-utf8-locales@2.29 glibc@2.29 gmp@6.1.2 gnutls@3.6.9 grep@3.3 guile@2.0.14 gzip@1.10 ld-wrapper@0 libcap@2.27 libidn2@2.2.0 libpsl@0.21.0 libsigsegv@2.12 lzip@1.21 make@4.2.1 ncurses@6.1-20190609 patch@2.7.6 pcre@8.43 perl-http-daemon@6.01 perl-io-socket-ssl@2.066 perl@5.30.0 pkg-config@0.29.2 python@3.7.4 sed@4.7 tar@1.32 xz@5.2.4
: Package closure: 148 packages
:   acl@2.2.53 attr@2.4.48 autoconf@2.69 bash-minimal@5.0.7 bash-static@5.0.7 bash@5.0.7 binutils-cross-boot0@2.32 binutils-mesboot0@2.20.1a binutils-mesboot@2.20.1a binutils@2.32 bison@3.4.1 bootstrap-binaries@0 bootstrap-mes@0 bootstrap-mescc-tools@0.5.2 bzip2@1.0.6 coreutils@8.31 diffutils-boot0@3.7 diffutils-mesboot@2.7 diffutils@3.7 ed@1.15 expat@2.2.7 file-boot0@5.33 file@5.33 findutils-boot0@4.6.0 findutils@4.6.0 flex@2.6.4 fontconfig@2.13.1 freetype@2.10.1 gawk@5.0.1 gcc-core-mesboot@2.95.3 gcc-cross-boot0-wrapped@7.4.0 gcc-cross-boot0@7.4.0 gcc-mesboot-wrapper@4.9.4 gcc-mesboot0@2.95.3 gcc-mesboot1-wrapper@4.7.4 gcc-mesboot1@4.7.4 gcc-mesboot@4.9.4 gcc@7.4.0 gdbm@1.18.1 gettext-boot0@0.19.8.1 gettext-minimal@0.20.1 gfortran-toolchain@7.4.0 gfortran@7.4.0 glibc-headers-mesboot@2.16.0 glibc-intermediate@2.29 glibc-mesboot0@2.2.5 glibc-mesboot@2.16.0 glibc-utf8-locales@2.29 glibc@2.29 gmp@6.1.2 gnutls@3.6.9 gperf@3.1 grep@3.3 gs-fonts@8.11 guile-bootstrap@2.0 guile@2.0.14 guile@2.2.6 gzip@1.10 isl@0.21 ld-wrapper-boot0@0 ld-wrapper-boot3@0 ld-wrapper@0 libatomic-ops@7.6.10 libbsd@0.9.1 libcap@2.27 libelf@0.8.13 libffi@3.2.1 libgc@7.6.12 libgcrypt@1.8.4 libgpg-error@1.36 libidn2@2.2.0 libltdl@2.4.6 libpng@1.6.37 libpsl@0.21.0 libpthread-stubs@0.4 libsigsegv@2.12 libstdc++-boot0@4.9.4 libstdc++@7.4.0 libtasn1@4.14 libunistring@0.9.10 libx11@1.6.8 libxau@1.0.9 libxcb@1.13 libxdmcp@1.1.3 libxext@1.3.4 libxft@2.3.3 libxml2@2.9.9 libxrender@0.9.10 libxslt@1.1.33 linux-libre-headers-bootstrap@0 linux-libre-headers@4.19.56 lzip@1.21 m4@1.4.18 make-boot0@4.2.1 make-mesboot0@3.80 make-mesboot@3.82 make@4.2.1 mes-boot@0.19 mesboot-headers@0.19 mpc@1.1.0 mpfr@4.0.2 ncurses@6.1-20190609 net-base@5.3 net-tools@1.60-0.479bb4a nettle@3.5.1 openssl@1.1.1c patch@2.7.6 pcre@8.43 perl-boot0@5.30.0 perl-encode-locale@1.05 perl-http-daemon@6.01 perl-http-date@6.02 perl-http-message@6.18 perl-io-html@1.00 perl-io-socket-ssl@2.066 perl-lwp-mediatypes@6.02 perl-net-ssleay@1.88 perl-test-needs@0.002005 perl-try-tiny@0.30 perl-uri@1.76 perl@5.30.0 pkg-config@0.29.2 python-minimal-wrapper@3.7.4 python-minimal@3.5.7 python-minimal@3.7.4 python-wrapper@3.7.4 python@3.7.4 readline@8.0 sed@4.7 sqlite@3.28.0 tar@1.32 tcc-boot0@0.9.26-6.c004e9a tcc-boot@0.9.27 tcl@8.6.9 tcsh@6.20.00 texinfo@6.6 tk@8.6.9.1 tzdata@2019b unzip@6.0 util-linux@2.34 util-macros@1.19.2 wget@1.20.3 which@2.21 xcb-proto@1.13 xorgproto@2019.1 xtrans@1.4.0 xz@5.2.4 zlib@1.2.11

